Table of Contents
 Class ReinforcedBar
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Reinforced bar
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.ReinfBar,CI.ReinforcedSection")]
public class ReinforcedBar : OpenObject
Inheritance
object
OpenObject
ReinforcedBar
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Diameter
Diameter
public double Diameter { get; set; }
Property Value
double
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 Point
Position of bar
[OpenModelProperty("CentrePoint")]
public Point2D Point { get; set; }
Property Value
Point2D
 Edit this page